### Loading Data and Statistical Analysis

In [1]:
import numpy as np
import pandas as pd

In [8]:
# we may load external data
# df = pd.read_csv('data/salaries.csv') # or xml, json, excel, etc.
# or load from a URL
url = 'https://raw.githubusercontent.com/onionmccabbage/pythonFurtherAdvancedSept2025/refs/heads/main/data/Salaries.csv'
df = pd.read_csv(url)
df.head(7) # or tail()
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [16]:
# we may examine our data strucure
df.columns
df.size
df['salary'].mean() # for one column
df[['service', 'salary']].mean() # a list of columns
df.max()

rank            Prof
discipline         B
phd               56
service           51
sex             Male
salary        186960
dtype: object

#### Grouping and Aggregating Data

In [31]:
df_rank = df.groupby(['rank'])
# anything done in np or pd is very performant - even for massive data sets
df_rank[['salary']].mean() # consider single [] or double [[]]

                  salary
rank
AssocProf   91786.230769
AsstProf    81362.789474
Prof       123624.804348

In [34]:
# some meanigful analysis
df_n = df.groupby(['sex'])
df_n[['salary']].mean()

                 salary
sex    salary
Female 62884    62884.0
       63100    63100.0
       71065    71065.0
       72500    72500.0
       73300    73300.0
...                 ...
Male   153750  153750.0
       155750  155750.0
       155865  155865.0
       162200  162200.0
       186960  186960.0

[75 rows x 1 columns]